{
  "000355306-2024-09-03": {
    "uid": "000355306-2024-09-03",
    "type": "Certificate",
    "career": "Graduate",
    "name": "Adult Education Postbaccalaureate Certificate",
    "diploma": "Adult Education - Grad Level",
    "info": "The graduate program in adult education (AdEd), is a specialized academic area of the Human Resource Development program track in the Department of Organizational Leadership, Policy, and Development. AdEd graduate programs prepare individuals to work with adults in a variety of roles, such as program developers, teachers, advisors, administrators, and managers in a variety of formal and informal settings, such as educational institutions, business and industry, community agencies, healthcare organizations, continuing and professional education, and adult basic education.",
    "programMinCredit": "14",
    "programMaxCredit": null,
    "degreeMinCredit": null,
    "degreeMaxCredit": null
  },
  "000357806-2024-09-03": {
    "uid": "000357806-2024-09-03",
    "type": "Certificate",
    "career": "Undergraduate",
    "name": "Adult Education Undergraduate Certificate",
    "diploma": "Adult Education - Undergraduate Level",
    "info": "Adult Education Undergraduate Certificate",
    "programMinCredit": "14",
    "programMaxCredit": null,
    "degreeMinCredit": null,
    "degreeMaxCredit": null
  },
  "00055C620-2024-09-03": {
    "uid": "00055C620-2024-09-03",
    "type": "Certificate",
    "career": "Graduate",
    "name": "Aging Studies Postbaccalaureate Certificate",
    "diploma": "Aging Studies",
    "info": "",
    "programMinCredit": "12",
    "programMaxCredit": null,
    "degreeMinCredit": null,
    "degreeMaxCredit": null
  },
  "009352918-2024-09-03": {
    "uid": "009352918-2024-09-03",
    "type": "Certificate",
    "career": "Undergraduate",
    "name": "Applied Business Certificate",
    "diploma": "Applied Business - Undergraduate Level",
    "info": "The certificate in applied business emphasizes utility and relevance. The option for a fully online curriculum makes this certificate among the most accessible of academic business credentials. Based on the recommendations of private, public, and nonprofit employers, the certificate offers specialized focus areas that target professional needs. This approach ensures its immediate applicability and value.\n\nThe certificate in applied business allows students to choose one of four focus areas that best complements their career plans:\n\n1. Applied business essentials\n2. Managing in health systems organizations\n3. Managing for sustainability, innovation, and quality\n4. Self-designed ",
    "programMinCredit": "15",
    "programMaxCredit": null,
    "degreeMinCredit": null,
    "degreeMaxCredit": null
  },
  "018757506-2024-09-03": {
    "uid": "018757506-2024-09-03",
    "type": "Certificate",
    "career": "Undergraduate",
    "name": "Sports Coaching Certificate",
    "diploma": "Coaching - Undergraduate Level",
    "info": "",
    "programMinCredit": "12",
    "programMaxCredit": null,
    "degreeMinCredit": null,
    "degreeMaxCredit": null
  },
  "025650606-2024-09-03": {
    "uid": "025650606-2024-09-03",
    "type": "Certificate",
    "career": "Graduate",
    "name": "Specialist in Education and General Education Administration Certificate",
    "diploma": "Specialist in Education and General Education Administration",
    "info": "Applications to this certificate currently are not being accepted.\n\nThe Department of Organizational Leadership, Policy, and Development is a leader in advancing knowledge about educational and organizational change in local, national, and international contexts. Our research, teaching, and outreach reflect a commitment to interdisciplinary and intercultural engagement with educators, scholars, and policy makers seeking to enhance leadership, policy, and development around the globe. Students in the MA and PhD programs choose from one of five complementary but distinct program tracks: education policy and leadership (EPL), evaluation studies (ES), higher education (HE), comparative and international development education (CIDE), and Human Resource Development (HRD). Our undergraduate programs focus on human resource development and business and marketing education. In addition, the department offers a variety of programs for practicing professionals and various licensure programs.",
    "programMinCredit": "60",
    "programMaxCredit": null,
    "degreeMinCredit": null,
    "degreeMaxCredit": null
  },
  "026051106-2024-09-03": {
    "uid": "026051106-2024-09-03",
    "type": "Certificate",
    "career": "Graduate",
    "name": "Educational Psychology Specialist Certificate in Education and School Psychological Services",
    "diploma": "Specialist in Education and School Psychological Services",
    "info": "Students' graduate preparation focuses on the knowledge and skills necessary to engage in provision of research-based school psychological practices within multi-tier systems of support to improve academic, social, behavioral, and emotional competence of children and youth, as well as to develop, implement, and use applied research in school settings. Students develop specific competencies through a broad range of didactic courses, research activities, and field placements, including practica and a full-year internship. The specialist certificate is designed for students who want to become practitioners. The school psychology specialist certificate is approved by the Minnesota Board of Teaching and the National Association of School Psychologists. Graduates are eligible for the Minnesota school psychologist credential, and the national certification in school psychology, as well as the school psychology credential in most states.",
    "programMinCredit": "60",
    "programMaxCredit": 60,
    "degreeMinCredit": null,
    "degreeMaxCredit": null
  },
  "026051306-2024-09-03": {
    "uid": "026051306-2024-09-03",
    "type": "Certificate",
    "career": "Graduate",
    "name": "Educational Psychology Specialist Certificate in Education and Special Education",
    "diploma": "Specialist in Education and Special Education",
    "info": "The special education track aims to improve outcomes for individuals who require specialized support to experience success across the lifespan. We are committed to engaging in meaningful research and to bridging research and practice to improve the lives of children and families in diverse contexts, and to have a lasting impact on teacher education, leadership, and policy. Early involvement in research projects and the development of original research addressing the needs of individuals requiring specialized support is encouraged and may include focused attention to intervention science, implementation science, social and cognitive development, behavioral and psychological management, language and communication skills, and/or the design and use of technology to promote impact. \n\nThe special education track focuses on the attainment of core competencies required for special education professionals as well as interdisciplinary skills and goals needed to address diverse challenges in diverse contexts. A complementary emphasis is placed on systematic understanding and problem solving in relation to social and cultural perceptions, care, education, intervention, and support of persons with disabilities.",
    "programMinCredit": "60",
    "programMaxCredit": 60,
    "degreeMinCredit": null,
    "degreeMaxCredit": null
  },
  "040259606-2024-09-03": {
    "uid": "040259606-2024-09-03",
    "type": "Certificate",
    "career": "Undergraduate",
    "name": "Human Resource Development Certificate",
    "diploma": "Human Resource Development - Undergraduate Level",
    "info": "The Human Resource Development Certificate equips learners with the knowledge, skills, and abilities that enable them to make meaningful contributions to the advancement of organizational systems in a variety of sectors, based on the principles, methods, and tools of the fields of workplace learning, training, organization development, leadership development, and career development. \n\nHuman Resource Development is a growing field analyzing what organizations need in human capacity and what individuals need in order to feel capable and connected in their work. Our certificate focuses on the practical application of Human Resource Development theory and research.\n\nBoost your organization's effectiveness through research-driven practices. Learn how to identify gaps in skills, knowledge, and technology for organizational units, and be able to understand and recommend a variety of development approaches and options.",
    "programMinCredit": "14",
    "programMaxCredit": null,
    "degreeMinCredit": null,
    "degreeMaxCredit": null
  },
  "040259706-2024-09-03": {
    "uid": "040259706-2024-09-03",
    "type": "Certificate",
    "career": "Graduate",
    "name": "Human Resource Development Postbaccalaureate Certificate",
    "diploma": "Human Resource Development - Grad Level",
    "info": "The certificate program in human resource development (HRD) focuses on training of human resources and organizational change issues. The HRD program is offered by the Organizational Leadership, Policy, and Development (OLPD) in the College of Education and Human Development (CEHD). Courses at the University of Minnesota campus are offered at a variety of times, including late afternoons and evenings. ",
    "programMinCredit": "14",
    "programMaxCredit": null,
    "degreeMinCredit": null,
    "degreeMaxCredit": null
  },
  "05845K117-2024-09-03": {
    "uid": "05845K117-2024-09-03",
    "type": "Certificate",
    "career": "Graduate",
    "name": "Music Education Post-Baccalaureate Licensure Certificate",
    "diploma": "Music Education",
    "info": "This post-baccalaureate certificate has two emphases that align with state teacher education requirements: K­12 Instrumental/General Music and K­12 Vocal/General Music. The certificate enables students with previous performance degrees to complete the required curriculum for licensure to teach music in K­12 settings in the state of Minnesota. ",
    "programMinCredit": "42",
    "programMaxCredit": "46",
    "degreeMinCredit": null,
    "degreeMaxCredit": null
  },
  "09135B817-2024-09-03": {
    "uid": "09135B817-2024-09-03",
    "type": "Certificate",
    "career": "Graduate",
    "name": "Technical Communication Postbaccalaureate Certificate",
    "diploma": "Technical Communication",
    "info": "The Department of Writing Studies trains students to understand how people use written communication (digital, visual, textual) to shape the world around them, with a particular emphasis on communication in scientific and technical areas. The Certificate in Technical Communication focuses on applying basic theory and research-driven approaches to create and adapt content to solve complex problems in technical communication workplaces. Students connect with workplace professionals through client projects, virtual and global teamwork, mentorships, and emerging technologies. These experiences enable students to develop unique strengths in digital, usability, and science/health/medical communication. \n\nCertificate courses are taught by graduate faculty who themselves have active research agendas in these areas. Students also have the opportunity to work with the Technical Communication Advisory Board (TCAB), a group of business leaders who provide pathways to experiential learning opportunities including networking, mentoring, and internships.\n\nThis fully online program equips professionals for transition to the technical communication field and/or serves as the foundation for specialized study at the master's level that is tailored to career goals. All coursework from the Certificate can be applied to the MS in Scientific and Technical Communication upon admission to the MS and with program approval.",
    "programMinCredit": "15",
    "programMaxCredit": 15,
    "degreeMinCredit": null,
    "degreeMaxCredit": null
  },
  "100653518-2024-09-03": {
    "uid": "100653518-2024-09-03",
    "type": "Certificate",
    "career": "Undergraduate",
    "name": "Construction Management Certificate",
    "diploma": "Construction Management",
    "info": "This undergraduate certificate will give you an in-depth understanding of the design and technology framework and the communication and management skills required for your career advancement. Designed and taught by industry professionals, the program is for people interested in a career as a construction manager or industry professional who want to increase their knowledge of new technologies or improve their management and communication skills.",
    "programMinCredit": 18,
    "programMaxCredit": null,
    "degreeMinCredit": null,
    "degreeMaxCredit": null
  },
  "101451606-2024-09-03": {
    "uid": "101451606-2024-09-03",
    "type": "Certificate",
    "career": "Graduate",
    "name": "Disability Policy and Services Postbaccalaureate Certificate",
    "diploma": "Disability Policy and Services",
    "info": "The certificate in disability policy and services is designed to allow graduate, as well as community professionals, to study policies and services that affect the lives of children, youth, and adults with disabilities. The 12-credit program surveys the spectrum of education, health, and social services available to individuals with disabilities and their families, and examines the public and private networks of disability services from an interdisciplinary perspective. While the program addresses the needs of people with all types of disabilities, it emphasizes developmental disabilities across the lifespan. The program's individualized learning experience (ILE) requires students to integrate theory with practice by completing a disability-related research project or working directly with people with disabilities in settings such as schools, recreation centers, or human-service agencies.",
    "programMinCredit": "12",
    "programMaxCredit": 12,
    "degreeMinCredit": null,
    "degreeMaxCredit": null
  },
  "11855G720-2024-09-03": {
    "uid": "11855G720-2024-09-03",
    "type": "Certificate",
    "career": "Graduate",
    "name": "Clinical Research Postbaccalaureate Certificate",
    "diploma": "Clinical Research",
    "info": "The certificate program in clinical research is designed for research coordinators, clinical research project managers, and other health professionals who want to learn how to implement and manage clinical research studies. Applicants must have a bachelor's degree and at least two years of relevant clinical experience or research experience. Students can pursue the certificate on a part-time basis.\n\nThe School of Public Health is accredited by the Council on Education for Public Health (CEPH).",
    "programMinCredit": "16",
    "programMaxCredit": null,
    "degreeMinCredit": null,
    "degreeMaxCredit": null
  },
  "151552106-2024-09-03": {
    "uid": "151552106-2024-09-03",
    "type": "Certificate",
    "career": "Graduate",
    "name": "Professional Development Postbaccalaureate Certificate",
    "diploma": "Professional Development - Grad Level",
    "info": "The certificate in professional development is designed to prepare leaders in designing, implementing, and evaluating learning opportunities for preK-12 educators and related staff.\n\nThis 12- to 15-credit graduate-level program offers professional development opportunities for teachers, administrators, and others involved in school improvement initiatives. Throughout the program, students are required to reflect on their learning, make explicit connections between theory and practice, and design staff development processes and materials for use in their own work contexts.\n\nThrough the program, participants will:\n- Learn to apply research-based standards for staff development\n- Be prepared for the multifaceted roles and competencies of staff developers\n- Identify organizational and leadership capacities for effective staff development policies and practices\n- Be able to articulate effective staff learning principles, designs, and strategies\n- Evaluate staff development, including its effects on students, staff, and systems\n- Learn to work effectively with groups, including both facilitation and training models of learning\n- Identify and access staff development resources, including current research and best practices literature\n- Gain awareness of individual strengths and areas for continuous improvement as a professional educator and leader of staff learning",
    "programMinCredit": "12",
    "programMaxCredit": "15",
    "degreeMinCredit": null,
    "degreeMaxCredit": null
  },
  "200158106-2024-09-03": {
    "uid": "200158106-2024-09-03",
    "type": "Certificate",
    "career": "Graduate",
    "name": "K-12 Technology Integration Postbaccalaureate Certificate",
    "diploma": "Technology Enhanced Learning: K-12 Technology Integration  - Grad Level",
    "info": "The K-12 Technology Integration certificate program prepares students to use technology (computers and the web) to develop instructional materials for use in a wide range of educational contexts (note that a university certificate program or certificate is distinct from a state certificate or certification). \n\nThe program is designed for K-12 teachers or administrators interested in using technology in the classroom.",
    "programMinCredit": "12",
    "programMaxCredit": null,
    "degreeMinCredit": null,
    "degreeMaxCredit": null
  },
  "200258206-2024-09-03": {
    "uid": "200258206-2024-09-03",
    "type": "Certificate",
    "career": "Graduate",
    "name": "Multimedia Design and Development Postbaccalaureate Certificate",
    "diploma": "Technology Enhanced Learning: Multimedia Design and Development - Grad Level",
    "info": "*The certificate in multimedia design and development is not currently accepting applications*\n\nThis certificate program in multimedia design and development prepares students to use technology (computers and the Internet) to develop instructional materials for use in a wide range of educational and training contexts (note that a university certificate program or certificate is distinct from a state certificate or certification). \n\nThe program is designed for K-12 teachers, higher education instructors, corporate trainers, and other professionals interested in using technology to support instruction.",
    "programMinCredit": "12",
    "programMaxCredit": null,
    "degreeMinCredit": null,
    "degreeMaxCredit": null
  },
  "202953206-2024-09-03": {
    "uid": "202953206-2024-09-03",
    "type": "Certificate",
    "career": "Graduate",
    "name": "Program Evaluation Postbaccalaureate Certificate",
    "diploma": "Program Evaluation",
    "info": "The program evaluation certificate program offers intensive study of processes and applied methods for evaluating programs and services in school, health, government, nonprofit agencies, and market research settings. This interdisciplinary program surveys program evaluation techniques and processes and examines the social and political contexts of the studies. The program allows working professionals from a variety of disciplines to formalize their training in program evaluation by earning a certificate in this area. Demand for trained professionals in program evaluation has increased steadily to meet the reporting needs of funding agencies, policymakers, and program managers in the public and private sectors. Graduates of evaluation studies programs have found employment in county government, social service agencies, state departments, and research consulting firms and businesses.",
    "programMinCredit": "12",
    "programMaxCredit": "13",
    "degreeMinCredit": null,
    "degreeMaxCredit": null
  },
  "203458916-2024-09-03": {
    "uid": "203458916-2024-09-03",
    "type": "Certificate",
    "career": "Graduate",
    "name": "Policy Issues on Work and Pay Postbaccalaureate Certificate",
    "diploma": "Policy Issues on Work and Pay",
    "info": "The Policy Issues in Work and Pay post-baccalaureate certificate provides an understanding of, and the ability to evaluate and develop, federal, state, and local policies that affect the employment relationship. Students learn about the role of government in the employment relationship, including statutes, and how employers, unions, and the government interpret and utilize policies.",
    "programMinCredit": "15",
    "programMaxCredit": null,
    "degreeMinCredit": null,
    "degreeMaxCredit": null
  },
  "204151920-2024-09-03": {
    "uid": "204151920-2024-09-03",
    "type": "Certificate",
    "career": "Graduate",
    "name": "Public Health Core Concepts Postbaccalaureate Certificate",
    "diploma": "Public Health Core Concepts",
    "info": "The Public Health Core Concepts Certificate program is designed for working health or human services professionals and includes the core content from our Master of Public Health degree programs. The certificate provides training that prepares public health workers and others to respond to emerging public health issues.  \n\nThe School of Public Health is accredited by the Council on Education for Public Health (CEPH).",
    "programMinCredit": "15",
    "programMaxCredit": 16,
    "degreeMinCredit": null,
    "degreeMaxCredit": null
  },
  "204651706-2024-09-03": {
    "uid": "204651706-2024-09-03",
    "type": "Certificate",
    "career": "Graduate",
    "name": "Dual Language and Immersion Education Postbaccalaureate Certificate",
    "diploma": "Dual Language and Immersion Education",
    "info": "This graduate-level certificate program gives students an opportunity to complete a coordinated series of courses in the area of dual language and immersion education. The program does not lead to a state teaching certificate or licensure (note that a university certificate program or certificate is distinct from a state certificate or certification). \n\nIn Minnesota and other states in the US, dual language/immersion teachers at the elementary level are required to hold a teaching license in elementary education, and at the secondary level a license in the subject matter they teach (e.g., science, social studies, math). The University of Minnesota offers an initial teacher licensure program in elementary education with a focus on dual language and immersion education. \n\nThe dual language and immersion education certificate program is designed for preK-12 teachers and other professionals to be able to work effectively in the following school-based program models: \n- \"One-way\" foreign language immersion programs designed for native English-speaking students \n- \"Two-way\" bilingual immersion programs designed for native English-speaking students and native speakers of the program's partner language, such as Spanish \n- Developmental bilingual programs designed for minority language learners, such as native Spanish speakers \n- Indigenous language immersion programs designed for Native American children in indigenous communities with the goal of revitalizing an endangered language and culture \n\nIn dual language and immersion programs, the second/foreign/minority language that students are acquiring is a vehicle to teach school subjects. In order to be considered a dual language or immersion program, the immersion language must be used for at least 50 percent of subject-matter instruction during the elementary school years. In a middle/secondary continuation program, at least two, year-long content courses must be taught in the immersion language. \n\nThese programs aim for \"additive bilingualism and biliteracy,\" or the acquisition of another language at no expense to the first, native language. \n\nThis unique University certificate program incorporates a coherent set of courses designed specifically for dual language and immersion teachers, and other professionals. Offered by the college's Department of Curriculum and Instruction (C&I), the program was designed jointly by the college's Second Language Education faculty, and representatives of dual language and immersion programs in the Twin Cities metropolitan area.",
    "programMinCredit": "15",
    "programMaxCredit": null,
    "degreeMinCredit": null,
    "degreeMaxCredit": null
  },
  "204952306-2024-09-03": {
    "uid": "204952306-2024-09-03",
    "type": "Certificate",
    "career": "Graduate",
    "name": "Talent Development and Gifted Education Postbaccalaureate Certificate",
    "diploma": "Talent Development and Gifted Education - Grad Level",
    "info": "This 12-credit certificate program is intended to give teachers, administrators, education professionals, and other individuals with an interest in the education of gifted and talented students the opportunity to obtain the knowledge and skills necessary to develop, implement, and supervise programs in the education of gifted and talented students. ",
    "programMinCredit": "12",
    "programMaxCredit": 12,
    "degreeMinCredit": null,
    "degreeMaxCredit": null
  },
  "206752618-2024-09-03": {
    "uid": "206752618-2024-09-03",
    "type": "Certificate",
    "career": "Undergraduate",
    "name": "Information Technology Infrastructure Certificate",
    "diploma": "Information Technology Infrastructure",
    "info": "The information technology (IT) infrastructure certificate will help you develop the knowledge and skills to design, implement, and maintain the IT infrastructure that organizations need to manage daily business practices. Designed and taught by industry professionals, the curriculum emphasizes hands-on learning and application as well as theory, allowing you to apply what you've learned right away. You can select from six different track options, including data science, data management, dev ops (development and operations), networking, security and systems, or design your own curriculum with guidance and support from program staff.",
    "programMinCredit": "14",
    "programMaxCredit": null,
    "degreeMinCredit": null,
    "degreeMaxCredit": null
  },
  "207953720-2024-09-03": {
    "uid": "207953720-2024-09-03",
    "type": "Certificate",
    "career": "Graduate",
    "name": "Public Health Preparedness, Response, and Recovery Postbaccalaureate Certificate",
    "diploma": "Public Health Preparedness/Response/Recovery",
    "info": "This certificate program helps to prepare public health workers and others to effectively respond to emerging public health threats, including infectious diseases, natural disasters, and a range of environmental exposure events.",
    "programMinCredit": "12",
    "programMaxCredit": null,
    "degreeMinCredit": null,
    "degreeMaxCredit": null
  },
  "208053820-2024-09-03": {
    "uid": "208053820-2024-09-03",
    "type": "Certificate",
    "career": "Graduate",
    "name": "Public Health Food Protection Postbaccalaureate Certificate",
    "diploma": "Public Health Food Protection",
    "info": "The Public Health Food Protection certificate is designed for professionals working in health or human services. It prepares public health workers and others to respond to incidents of bioterrorism, infectious disease outbreaks, and other emerging public health issues. Many students use the knowledge and skills gained to enhance opportunities in their current work or career path.\n\nThe curriculum can be completed by attending at least two sessions of the Public Health Institute, held in May and June every year.",
    "programMinCredit": "14",
    "programMaxCredit": null,
    "degreeMinCredit": null,
    "degreeMaxCredit": null
  },
  "208554304-2023-09-05": {
    "uid": "208554304-2023-09-05",
    "type": "Certificate",
    "career": "",
    "name": "Endodontics",
    "diploma": "Endodontics",
    "info": "TBD",
    "programMinCredit": 30,
    "programMaxCredit": null,
    "degreeMinCredit": null,
    "degreeMaxCredit": null
  },
  "208654404-2023-09-05": {
    "uid": "208654404-2023-09-05",
    "type": "Certificate",
    "career": "",
    "name": "General Practice Residency",
    "diploma": "Advanced Education in General Practice Residency",
    "info": "TBD",
    "programMinCredit": 30,
    "programMaxCredit": null,
    "degreeMinCredit": null,
    "degreeMaxCredit": null
  },
  "208754504-2023-09-05": {
    "uid": "208754504-2023-09-05",
    "type": "Certificate",
    "career": "",
    "name": "Oral Hlth. Serv. for Older Ads",
    "diploma": "Oral Health Services for Older Adults",
    "info": "TBD",
    "programMinCredit": 30,
    "programMaxCredit": null,
    "degreeMinCredit": null,
    "degreeMaxCredit": null
  },
  "208854604-2023-09-05": {
    "uid": "208854604-2023-09-05",
    "type": "Certificate",
    "career": "",
    "name": "Orofacial Pain",
    "diploma": "Advanced Education in Orofacial Pain",
    "info": "TBD",
    "programMinCredit": 30,
    "programMaxCredit": null,
    "degreeMinCredit": null,
    "degreeMaxCredit": null
  },
  "209054904-2023-09-05": {
    "uid": "209054904-2023-09-05",
    "type": "Certificate",
    "career": "",
    "name": "Prosthodontics",
    "diploma": "Advanced Education in Prosthodontics",
    "info": "TBD",
    "programMinCredit": 30,
    "programMaxCredit": null,
    "degreeMinCredit": null,
    "degreeMaxCredit": null
  },
  "209155004-2023-09-05": {
    "uid": "209155004-2023-09-05",
    "type": "Certificate",
    "career": "",
    "name": "Periodontics",
    "diploma": "Advanced Education in Periodontics",
    "info": "TBD",
    "programMinCredit": 30,
    "programMaxCredit": null,
    "degreeMinCredit": null,
    "degreeMaxCredit": null
  },
  "209255104-2023-09-05": {
    "uid": "209255104-2023-09-05",
    "type": "Certificate",
    "career": "",
    "name": "Pediatric Dentistry",
    "diploma": "Advanced Education in Pediatric Dentistry",
    "info": "TBD",
    "programMinCredit": 30,
    "programMaxCredit": null,
    "degreeMinCredit": null,
    "degreeMaxCredit": null
  },
  "209355404-2023-09-05": {
    "uid": "209355404-2023-09-05",
    "type": "Certificate",
    "career": "",
    "name": "Orthodontics",
    "diploma": "Advanced Education in Orthodontics",
    "info": "TBD",
    "programMinCredit": 30,
    "programMaxCredit": null,
    "degreeMinCredit": null,
    "degreeMaxCredit": null
  },
  "209455504-2023-09-05": {
    "uid": "209455504-2023-09-05",
    "type": "Certificate",
    "career": "",
    "name": "Oral & Maxillofacial Surgery",
    "diploma": "Advanced Education in Oral & Maxillofacial Surgery",
    "info": "TBD",
    "programMinCredit": 30,
    "programMaxCredit": null,
    "degreeMinCredit": null,
    "degreeMaxCredit": null
  },
  "209855703-2023-09-01": {
    "uid": "209855703-2023-09-01",
    "type": "Certificate",
    "career": "",
    "name": "Clinical Training",
    "diploma": "Clinical Training",
    "info": "TBD",
    "programMinCredit": 30,
    "programMaxCredit": null,
    "degreeMinCredit": null,
    "degreeMaxCredit": null
  },
  "209955803-2023-09-01": {
    "uid": "209955803-2023-09-01",
    "type": "Certificate",
    "career": "",
    "name": "Foreign Grad. Train.",
    "diploma": "Foreign Graduate Training",
    "info": "TBD",
    "programMinCredit": 30,
    "programMaxCredit": null,
    "degreeMinCredit": null,
    "degreeMaxCredit": null
  },
  "210255906-2024-09-03": {
    "uid": "210255906-2024-09-03",
    "type": "Certificate",
    "career": "Graduate",
    "name": "PK-12 Administration Postbaccalaureate Certificate",
    "diploma": "PK-12 Administration",
    "info": "The PK-12 Administration post-baccalaureate certificate, housed within the University's Department of Organizational Leadership, Policy, and Development, offers coursework specifically designed to address competencies required by the state of Minnesota for the following licenses: K-12 Principal; Superintendent; Director of Special Education; and Director of Community Education.",
    "programMinCredit": "20",
    "programMaxCredit": "23",
    "degreeMinCredit": null,
    "degreeMaxCredit": null
  },
  "210356016-2024-09-03": {
    "uid": "210356016-2024-09-03",
    "type": "Certificate",
    "career": "Graduate",
    "name": "Nonprofit Management Postbaccalaureate Certificate",
    "diploma": "Nonprofit Management",
    "info": "The Nonprofit Management post-baccalaureate certificate is designed particularly for those individuals, whether students or working professionals, who want to pursue or further advance their careers in managing or leading a nonprofit organization. Students acquire knowledge and skills in effective leadership and management, organizational development, nonprofit governance, strategic planning, policy analysis, human resource development, finance, and fundraising. ",
    "programMinCredit": 12,
    "programMaxCredit": null,
    "degreeMinCredit": null,
    "degreeMaxCredit": null
  },
  "21055C506-2024-09-03": {
    "uid": "21055C506-2024-09-03",
    "type": "Certificate",
    "career": "Undergraduate",
    "name": "Teaching English as a Second Language Certificate",
    "diploma": "Teaching English as a Second Language",
    "info": "Four courses are required to complete the undergraduate certificate: Teaching English as a Second Language.\n\nThis certificate prepares students to teach English in community ESL programs, during study abroad, or after you graduate with programs like JET (Japan Exchange and Teaching), the Peace Corps, or the Fulbright English Teaching Assistants program. \n\nThis program DOES NOT lead to state teaching certification or licensure. ESL teaching licensure is offered only at the graduate level. More information is available on the C&I website (https://www.cehd.umn.edu/ci/academics/SLE/TESL-minor.html)",
    "programMinCredit": 14,
    "programMaxCredit": 15,
    "degreeMinCredit": null,
    "degreeMaxCredit": null
  },
  "211356122-2024-09-03": {
    "uid": "211356122-2024-09-03",
    "type": "Certificate",
    "career": "Graduate",
    "name": "Metropolitan Design Postbaccalaureate Certificate",
    "diploma": "Metropolitan Design",
    "info": "The metropolitan design certificate at the College of Design prepares students with the essential knowledge and understanding of the city within the complexities of the 21st-century metropolis.\n\nThe certificate is open to graduate students in the College of Design and other colleges. The certificate is a 12-credit program.\n\nInterested students should enroll during the second semester (spring) of graduate studies. It is recommended that students make a decision to enroll in the certificate early so that the completion of courses can be made within the time required for completion of the professional degree.",
    "programMinCredit": "12",
    "programMaxCredit": null,
    "degreeMinCredit": null,
    "degreeMaxCredit": null
  },
  "212055606-2024-09-03": {
    "uid": "212055606-2024-09-03",
    "type": "Certificate",
    "career": "Graduate",
    "name": "Adult Literacy Postbaccalaureate Certificate",
    "diploma": "Adult Literacy",
    "info": "The Adult Literacy Certificate is not taking applications at this time.\n\nThe Adult Literacy Certificate is designed to prepare teachers, administrators, trainers, and counselors in the broad political, social, economic, and theoretical aspects of adult literacy in a global environment.",
    "programMinCredit": "14",
    "programMaxCredit": null,
    "degreeMinCredit": null,
    "degreeMaxCredit": null
  },
  "212256403-2023-09-01": {
    "uid": "212256403-2023-09-01",
    "type": "Certificate",
    "career": "",
    "name": "Swine Medicine",
    "diploma": "Swine Medicine",
    "info": "TBD",
    "programMinCredit": 30,
    "programMaxCredit": null,
    "degreeMinCredit": null,
    "degreeMaxCredit": null
  },
  "21265A216-2024-09-03": {
    "uid": "21265A216-2024-09-03",
    "type": "Certificate",
    "career": "Graduate",
    "name": "Early Childhood Policy Postbaccalaureate Certificate",
    "diploma": "Early Childhood Policy",
    "info": "The Early Childhood Policy post-baccalaureate certificate gives students expertise in applying research-based knowledge to public policies affecting young children and the adults who care for them. The certificate provides a vehicle for students to gain fundamental early childhood policy skills and knowledge and to foster connection between the University of Minnesota and the early childhood policy community. Students may have opportunities to participate in the work of the Institute of Child Development's Human Capital Research Collaborative.",
    "programMinCredit": "12",
    "programMaxCredit": null,
    "degreeMinCredit": null,
    "degreeMaxCredit": null
  },
  "21305A706-2024-09-03": {
    "uid": "21305A706-2024-09-03",
    "type": "Certificate",
    "career": "Undergraduate",
    "name": "Autism Spectrum Disorder Certificate",
    "diploma": "Autism Spectrum Disorder",
    "info": "The certificate program in autism spectrum disorder (ASD) is designed to prepare teachers and related service personnel to design and deliver services to children and youth with ASD and their families. This 12-credit program offers specialized training in methods of assessment, intervention, and treatment evaluation. This program offers professional development opportunities for autism resource specialists, public and private social service agency staff, personnel at public and private schools, treatment facility personnel, and psychology and education professionals.",
    "programMinCredit": "12",
    "programMaxCredit": 12,
    "degreeMinCredit": null,
    "degreeMaxCredit": null
  },
  "21305A806-2024-09-03": {
    "uid": "21305A806-2024-09-03",
    "type": "Certificate",
    "career": "Graduate",
    "name": "Autism Spectrum Disorder Postbaccalaureate Certificate",
    "diploma": "Autism Spectrum Disorder",
    "info": "The certificate program in autism spectrum disorder (ASD) is designed to prepare teachers and related service personnel to design and deliver services to children and youth with ASD and their families. This 12-credit program provides a broad overview of major issues in ASD and specialized training in methods of assessment, intervention, and treatment evaluation. This program offers professional development opportunities for autism resource specialists, public and private social service agency staff, personnel at public and private schools, treatment facility personnel, and other human service professionals.",
    "programMinCredit": "12",
    "programMaxCredit": 12,
    "degreeMinCredit": null,
    "degreeMaxCredit": null
  },
  "21555B606-2024-09-03": {
    "uid": "21555B606-2024-09-03",
    "type": "Certificate",
    "career": "Graduate",
    "name": "Teaching Writing and Critical Literacy Postbaccalaureate Certificate",
    "diploma": "Teaching Writing and Critical Literacy",
    "info": "The certificate in teaching writing and critical literacy prepares preK-college educators to strengthen their skills and knowledge of current practice and research in the teaching of critical reading and writing (note that a university certificate program or certificate is distinct from a state certificate or certification).\n\nWriting and reading complement one another, and their interconnectedness is critical to literacy instruction. This certificate will offer advanced knowledge of the teaching of literacy through a focused, rigorous program while developing practicing educators' skills as teachers and writers in a supportive learning community.\n\nChanging literacy needs of students from all socioeconomic and educational backgrounds demand highly qualified teachers of reading and writing at the K-12 and postsecondary levels. Educators must prepare K-12 students to meet testing requirements at the state and national levels. In addition, teachers must meet the increasing literacy needs that accompany Minnesota's changing demographics of growing immigrant and English language learner (ELL) populations. Educators also must prepare students to communicate effectively by using new technologies.\n\nThe certificate program seeks to accomplish the following goals:\n\u0095 -Develop effective strategies for teaching the writing process to English-language learners and diverse populations, as well as reading and writing across the curriculum.\n\u0095 -Engage educators in current research about composition, reading, and learning theory.\n\u0095 -Create learning communities where educators reflect on their own teaching, reading, and writing.\n\u0095-Give educators opportunities to learn from other practicing educators.\n\nThis program begins with a three-week, 3-credit Minnesota Writing Project (MWP) Invitational Institute and then extends to allow educators to choose from a wider range of courses from multiple University departments throughout the academic year. ",
    "programMinCredit": "15",
    "programMaxCredit": null,
    "degreeMinCredit": null,
    "degreeMaxCredit": null
  },
  "21575B707-2024-09-03": {
    "uid": "21575B707-2024-09-03",
    "type": "Certificate",
    "career": "Graduate",
    "name": "Stream Restoration Science and Engineering Postbaccalaureate Certificate",
    "diploma": "Stream Restoration Science and Engineering",
    "info": "The Stream Restoration Science and Engineering post-baccalaureate certificate is a three-semester program producing graduates who understand how to blend engineering, physical, biological, and social sciences in prioritizing, designing, implementing, and evaluating stream restoration projects. ",
    "programMinCredit": "16",
    "programMaxCredit": null,
    "degreeMinCredit": null,
    "degreeMaxCredit": null
  },
  "21645B906-2024-09-03": {
    "uid": "21645B906-2024-09-03",
    "type": "Certificate",
    "career": "Graduate",
    "name": "Online Distance Learning Postbaccalaureate Certificate",
    "diploma": "Online Distance Learning",
    "info": "The online distance learning certificate is designed to prepare educators and other professionals to design and deliver distance learning opportunities in academic or business settings (note that a university certificate program or certificate is distinct from a state certificate or certification). Technology experience is not required, and courses are designed for learners with a wide range of experience.\n\nThis 12-credit certificate program will prepare students to successfully design, develop, and deliver curriculum on the Internet; use interactive online media; and create online learning communities for business and K-12 and postsecondary schools. As schools and businesses embrace online education, a variety of instructional design guidelines and pedagogical approaches have been developed to effectively guide online education and enhance learning.\n\nGoals of the distance learning certificate include:\n- Developing knowledge and skills in the best practices for designing and delivering online distance learning\n- Engaging with current research about distance learning, current practices, and learning theory\n- Providing opportunities to practice designing, developing, and delivering online distance learning\n- Creating learning communities where students can reflect on their own teaching, reading, designing, and writing\n- Allowing students to learn from each other\n",
    "programMinCredit": "12",
    "programMaxCredit": null,
    "degreeMinCredit": null,
    "degreeMaxCredit": null
  },
  "21705C206-2024-09-03": {
    "uid": "21705C206-2024-09-03",
    "type": "Certificate",
    "career": "Graduate",
    "name": "Infant and Early Childhood Mental Health Postbaccalaureate Certificate",
    "diploma": "Infant and Early Childhood Mental Health",
    "info": "The University of Minnesota online Infant and Early Childhood Mental Health (IECMH) Certificate Program is an intensive, interdisciplinary postbaccalaureate training program for students and professionals in domains of mental health, health and early care, and education.  \n\nThe program serves to deepen the knowledge and skills of individuals working in birth-to-five prevention, intervention, program administration, and policy development, and to prepare individuals to provide leadership in expanding the breadth and depth of relationship-based services and policies.\n\nThe IECMH certificate program is founded on a core set of principles of infant and early childhood mental health practice, asserting that services to families should be relationship-based, culturally sensitive, grounded in an understanding of developmental theory and research with special attention to the effects of trauma and supported by reflective practice. ",
    "programMinCredit": "20",
    "programMaxCredit": null,
    "degreeMinCredit": null,
    "degreeMaxCredit": null
  },
  "21805C306-2024-09-03": {
    "uid": "21805C306-2024-09-03",
    "type": "Certificate",
    "career": "Graduate",
    "name": "Parent Education Postbaccalaureate Certificate",
    "diploma": "Parent Education",
    "info": "The parent education certificate prepares well-qualified, parent education professionals to deliver programs designed to address the intellectual, emotional, cultural, social, and physical needs of parents and children in a variety of educational settings. These professionals will be positioned to work in a wide variety of areas, including some school-based parent education programs, preschools, child care centers, Head Start programs, health care and social-service agencies and institutions, and faith-based settings. ",
    "programMinCredit": "15",
    "programMaxCredit": "18",
    "degreeMinCredit": null,
    "degreeMaxCredit": null
  },
  "22075C906-2024-09-03": {
    "uid": "22075C906-2024-09-03",
    "type": "Certificate",
    "career": "Graduate",
    "name": "Undergraduate Multicultural Teaching and Learning Postbaccalaureate Certificate",
    "diploma": "Undergraduate Multicultural Teaching and Learning",
    "info": "The post baccalaureate certificate in undergraduate multicultural teaching and learning aims to improve the quality of instruction and academic support for all undergraduates, particularly those who traditionally have been underprepared for and underserved in higher education. The required core courses are designed to provide opportunities to apply multicultural theory to practice and engage as reflective practitioners.",
    "programMinCredit": "12",
    "programMaxCredit": null,
    "degreeMinCredit": null,
    "degreeMaxCredit": null
  },
  "22085D106-2024-09-03": {
    "uid": "22085D106-2024-09-03",
    "type": "Certificate",
    "career": "Graduate",
    "name": "Advanced Practices in Second Language Teaching Postbaccalaureate Certificate",
    "diploma": "Advanced Practices in Second Language Teaching",
    "info": "The University of Minnesota's Advanced Practices in Second Language Teaching Certificate program is designed for teachers of foreign languages and English as a second/foreign language and is offered by the Department of Curriculum and Instruction in partnership with the Center for Advanced Research on Language Acquisition (CARLA) Summer Institute Program.\n\nCourses are offered on the Twin Cities campus or online. The certificate may be completed independently or in conjunction with a Master of Education (MEd) degree in second language education at the University of Minnesota.\n\nAlthough the University certificate does not lead to teaching licensure or state certification, it adds value to a pre-service or in-service teacher's academic program and professional life. Completion of the advanced practices in second language teaching certificate includes successful participation in a set of internationally recognized, high-quality summer institutes for language teaching as well as courses in the Second Language Education program and provides a vehicle for teachers to receive tangible recognition of preparation in advanced language teaching practices and methodologies.",
    "programMinCredit": "12",
    "programMaxCredit": null,
    "degreeMinCredit": null,
    "degreeMaxCredit": null
  },
  "22215D714-2023-09-05": {
    "uid": "22215D714-2023-09-05",
    "type": "Certificate",
    "career": "",
    "name": "Adult Health/Gerontological Clinical Nurse Specialist Postgraduate Certificate",
    "diploma": "Adult Health/Gerontological Clinical Nurse Specialist",
    "info": "The postgraduate certificate program in nursing offers students with a doctor of nursing practice (DNP) or other graduate degree in a clinical nursing specialty area the opportunity to complete an additional area of study. Completion of required coursework and practice hours provides eligibility to take certification examinations.",
    "programMinCredit": "21",
    "programMaxCredit": "34",
    "degreeMinCredit": null,
    "degreeMaxCredit": null
  },
  "22225D814-2024-09-03": {
    "uid": "22225D814-2024-09-03",
    "type": "Certificate",
    "career": "Graduate",
    "name": "Adult/Gerontological Primary Care Nurse Practitioner Postgraduate Certificate",
    "diploma": "Adult/Gerontological Primary Care Nurse Practitioner",
    "info": "The postgraduate certificate program in nursing offers students with a doctor of nursing practice (DNP) in a clinical nursing specialty area the opportunity to complete an additional area of study. Completion of required coursework and practice hours provides eligibility to take certification examinations.",
    "programMinCredit": 21,
    "programMaxCredit": 34,
    "degreeMinCredit": null,
    "degreeMaxCredit": null
  },
  "22235D914-2024-09-03": {
    "uid": "22235D914-2024-09-03",
    "type": "Certificate",
    "career": "Graduate",
    "name": "Women's Health/Gender Related Nurse Practitioner Postgraduate Certificate",
    "diploma": "Women's Hlth/Gender Rltd NP",
    "info": "The postgraduate certificate program in nursing offers students with a Doctor of Nursing Practice (DNP) degree in a clinical nursing specialty area the opportunity to complete an additional area of study. Completion of required coursework and practice hours provides eligibility to take certification examinations.",
    "programMinCredit": "21",
    "programMaxCredit": "33",
    "degreeMinCredit": null,
    "degreeMaxCredit": null
  },
  "22275E414-2024-09-03": {
    "uid": "22275E414-2024-09-03",
    "type": "Certificate",
    "career": "Graduate",
    "name": "Nurse Midwifery Postgraduate Certificate",
    "diploma": "Nurse Midwifery",
    "info": "The postgraduate certificate program in nurse midwifery offers students with a doctor of nursing practice (DNP) in a clinical nursing specialty area the opportunity to complete an additional area of study. Completion of required coursework and practice hours provides eligibility to take certification examinations.",
    "programMinCredit": "24",
    "programMaxCredit": "38",
    "degreeMinCredit": null,
    "degreeMaxCredit": null
  },
  "22295E614-2024-09-03": {
    "uid": "22295E614-2024-09-03",
    "type": "Certificate",
    "career": "Graduate",
    "name": "Pediatric Clinical Nurse Specialist Postgraduate Certificate",
    "diploma": "Pediatric Clinical Nurse Specialist",
    "info": "The postgraduate certificate program in nursing offers students with a doctor of nursing practice (DNP)  in a clinical nursing specialty area the opportunity to complete an additional area of study. Completion of required coursework and practice hours provides eligibility to take certification examinations.",
    "programMinCredit": 29,
    "programMaxCredit": null,
    "degreeMinCredit": null,
    "degreeMaxCredit": null
  },
  "22305E714-2024-09-03": {
    "uid": "22305E714-2024-09-03",
    "type": "Certificate",
    "career": "Graduate",
    "name": "Pediatric Nurse Practitioner - Primary Care Postgraduate Certificate",
    "diploma": "Pediatric Primary Care Nurse Practioner",
    "info": "The postgraduate certificate program in nursing offers students with a Doctor of Nursing Practice (DNP) in a clinical nursing specialty area the opportunity to complete an additional area of study. Completion of required coursework and practice hours provides eligibility to take certification examinations.",
    "programMinCredit": 26,
    "programMaxCredit": null,
    "degreeMinCredit": null,
    "degreeMaxCredit": null
  },
  "22315E814-2024-09-03": {
    "uid": "22315E814-2024-09-03",
    "type": "Certificate",
    "career": "Graduate",
    "name": "Psychiatric Mental Health Nurse Practitioner Postgraduate Certificate",
    "diploma": "Psychiatric Mental Health Nurse Practitioner",
    "info": "The postgraduate certificate program in nursing offers students with a doctor of nursing practice (DNP) degree in a clinical nursing specialty area the opportunity to complete an additional area of study. Completion of required coursework and practice hours provides eligibility to take certification examinations.",
    "programMinCredit": "20",
    "programMaxCredit": "32",
    "degreeMinCredit": null,
    "degreeMaxCredit": null
  },
  "22375F207-2024-09-03": {
    "uid": "22375F207-2024-09-03",
    "type": "Certificate",
    "career": "Graduate",
    "name": "Fundamentals of Quantitative Finance Postbaccalaureate Certificate",
    "diploma": "Fundamentals of Quantitative Finance",
    "info": "The 15-credit Fundamentals of Quantitative Finance (FQF) certificate is good preparation for the Financial Mathematics master's (MFM) program. ",
    "programMinCredit": "15",
    "programMaxCredit": null,
    "degreeMinCredit": null,
    "degreeMaxCredit": null
  },
  "22385F306-2024-09-03": {
    "uid": "22385F306-2024-09-03",
    "type": "Certificate",
    "career": "Graduate",
    "name": "Clinical Physiology and Movement Science Postbaccalaureate Certificate",
    "diploma": "Clinical Physiology and Movement Science",
    "info": "The clinical physiology and movement science postbaccalaureate certificate program is aimed at D.N.P. and M.D. fellows in nursing and medicine, as well as professionals in clinical fields, such as physical, occupational, and speech therapy. In addition, engineers working in the area of medical technology or medical device development are potential candidates. The interdisciplinary coursework combines physiology and movement science with clinical skills for research and the diagnosis and assessment of disease conditions. Students have the option to tailor the program to their individual needs and interest. They may select from a list of more than 30 courses. Developed by faculty with a rich collective expertise from across the University, the programs offer students a choice of two tracks: clinical physiology and clinical movement science. ",
    "programMinCredit": "12",
    "programMaxCredit": null,
    "degreeMinCredit": null,
    "degreeMaxCredit": null
  },
  "22435P114-2024-09-03": {
    "uid": "22435P114-2024-09-03",
    "type": "Certificate",
    "career": "Graduate",
    "name": "Integrative Therapies & Healing Practices Postbaccalaureate Certificate",
    "diploma": "Integrative Therapies and Healing Practices",
    "info": "The Postbaccalaureate Certificate in Integrative Therapies and Healing Practices is an innovative, interdisciplinary program designed to expose students to a global range of integrative, complementary, cross-cultural, and spiritual healing practices. The program enables students to acquire advanced knowledge and skills to enhance their professional careers, their own lives, and the lives of their patients. Courses augment the preparation of students in health sciences and related disciplines, by developing knowledge and skills in the emerging field of integrative healthcare. Specifically, the certificate provides students with a theoretical basis for applying integrative therapies and healing practices; prepares students to evaluate research in integrative therapies and healing practices; and prepares students to work collaboratively with other health professionals and patients in a multicultural, pluralistic healthcare system. \n\nThe curriculum for the 12-credit certificate includes a core introductory course that provides the theoretical foundation for the program and a course in self-care. Students choose additional courses in clinical applications, spirituality, or cross-cultural health and healing. Students are encouraged to choose these elective credits from courses consistent with their academic training and professional goals. A faculty advisor will work with the student in designing a program plan that accommodates each student's unique learning objectives. The program draws upon the rich expertise of University and community-based faculty who encourage and challenge students to discover new ways of caregiving, and to cultivate diverse skills that will transform their life's work, experiences, and relationships with others. \n\nThe certificate may be completed concurrently with another graduate program or completed independently.\n\nStudents have the option to pursue a 14-credit Health Coaching track within the certificate. See the Program Sub-Plan section that follows for more information",
    "programMinCredit": "12",
    "programMaxCredit": "14",
    "degreeMinCredit": null,
    "degreeMaxCredit": null
  },
  "22485F814-2024-09-03": {
    "uid": "22485F814-2024-09-03",
    "type": "Certificate",
    "career": "Graduate",
    "name": "Leadership in Health Information Technology for Health Professionals Postbaccalaureate Certificate",
    "diploma": "Leadership in Health Information Tech for Health Professionals",
    "info": "By combining formal clinical or public health advanced preparation with course work in health information technology (HIT), individuals who earn the postbaccalaureate certificate in leadership in health information technology for health professionals will be able to lead the successful deployment and use of HIT to achieve transformational improvement in the quality, safety, outcomes, and thus in the value of health services.",
    "programMinCredit": 15,
    "programMaxCredit": null,
    "degreeMinCredit": null,
    "degreeMaxCredit": null
  },
  "22495F920-2024-09-03": {
    "uid": "22495F920-2024-09-03",
    "type": "Certificate",
    "career": "Graduate",
    "name": "Public Health Postbaccalaureate Certificate in Performance Improvement",
    "diploma": "Performance Improvement",
    "info": "NOTE: Applications to the Performance Improvement Certificate program are not being accepted at this time. For more information, please contact sph-ask@umn.edu.\n\nThe public health certificate in performance improvement trains students to understand and apply quality improvement methods at both the systems and organizational level. The program will provide the tools needed in order to achieve and maintain high process performance.\n\nThe certificate provides participants with hands-on knowledge about how to improve processes in their respective organizations. By so doing, best practices will be diffused, and process performance will improve public health services.\n\nThis certificate addresses concerns voiced by the National Board of Public Health Examiners, the Public Health Accreditation Board, and the Council on Education for Public Health to provide more educational opportunities in performance improvement to working public health professionals.",
    "programMinCredit": "12",
    "programMaxCredit": null,
    "degreeMinCredit": null,
    "degreeMaxCredit": null
  },
  "22535G216-2024-09-03": {
    "uid": "22535G216-2024-09-03",
    "type": "Certificate",
    "career": "Graduate",
    "name": "Public Affairs Leadership Postbaccalaureate Certificate",
    "diploma": "Public Affairs Leadership",
    "info": "The Public Affairs Leadership post-baccalaureate certificate is a 9-month program that offers mid-career professionals the specific knowledge and skills in public and nonprofit leadership, policy and program analysis, and evidence-based decision-making to succeed in today's public affairs environment.\n\nFor the convenience of working professionals both within and outside the Twin Cities metro area, students meet as part of a cohort for an intensive foundations week and in monthly Friday-Saturday meetings from September to May. Classes are in person. \n\n\n",
    "programMinCredit": "12",
    "programMaxCredit": null,
    "degreeMinCredit": null,
    "degreeMaxCredit": null
  },
  "22565G308-2024-09-03": {
    "uid": "22565G308-2024-09-03",
    "type": "Certificate",
    "career": "Graduate",
    "name": "Health Care Design and Innovation Postbaccalaureate Certificate",
    "diploma": "Health Care Design and Innovation",
    "info": "The postbaccalaureate certificate in health care design and innovation prepares health care and design practitioners to create optimal healing environments. Students learn how to apply design thinking in creating new processes, systems, and care environments. The certificate emphasizes principles that promote healing and safe patient care while maximizing clinical and financial outcomes.",
    "programMinCredit": "12",
    "programMaxCredit": null,
    "degreeMinCredit": null,
    "degreeMaxCredit": null
  },
  "22725G920-2024-09-03": {
    "uid": "22725G920-2024-09-03",
    "type": "Certificate",
    "career": "Graduate",
    "name": "Applied Biostatistics Postbaccalaureate Certificate",
    "diploma": "Applied Biostatistics",
    "info": "This primarily online certificate program is designed for working biostatisticians, such as data managers and analysts, who are not formally trained and want to improve their technical, mathematical, and computational skills.\n\nThe certificate focuses on key aspects of study design, implementation, and analysis for observational and clinical studies.\n\nThe School of Public Health is accredited by the Council on Education for Public Health (CEPH).",
    "programMinCredit": "15",
    "programMaxCredit": null,
    "degreeMinCredit": null,
    "degreeMaxCredit": null
  },
  "22805H218-2024-09-03": {
    "uid": "22805H218-2024-09-03",
    "type": "Certificate",
    "career": "Undergraduate",
    "name": "Facility Management Certificate",
    "diploma": "Facility Management",
    "info": "THIS PROGRAM IS NO LONGER ACCEPTING STUDENTS. The facility management certificate offers a comprehensive, multidisciplinary program in which students study the complete building life cycle, from design inception and construction to maintenance, recommissioning, and demolition, with the objective of serving on the owner's side to develop, construct, and maintain buildings for the long term.",
    "programMinCredit": "19",
    "programMaxCredit": null,
    "degreeMinCredit": null,
    "degreeMaxCredit": null
  },
  "22835H520-2024-09-03": {
    "uid": "22835H520-2024-09-03",
    "type": "Certificate",
    "career": "Graduate",
    "name": "Advanced Management Training for Clinician Leaders Postbaccalaureate Certificate",
    "diploma": "Advanced Management Training for Clinician Leaders",
    "info": "",
    "programMinCredit": "13",
    "programMaxCredit": null,
    "degreeMinCredit": null,
    "degreeMaxCredit": null
  },
  "23005M402-2024-09-03": {
    "uid": "23005M402-2024-09-03",
    "type": "Certificate",
    "career": "Graduate",
    "name": "Business Analytics Postbaccalaureate Certificate",
    "diploma": "Business Analytics",
    "info": "Business analytics and data science is one of the most sought after skill sets in modern industry. The Business Analytics certificate offers candidates the skills to extract insights with creative data analysis, and then apply the results in real business settings. ",
    "programMinCredit": "12",
    "programMaxCredit": null,
    "degreeMinCredit": null,
    "degreeMaxCredit": null
  },
  "23035H911-2024-09-03": {
    "uid": "23035H911-2024-09-03",
    "type": "Certificate",
    "career": "Graduate",
    "name": "Orthoptics Post-baccalaureate Certificate",
    "diploma": "Orthoptics",
    "info": "The Orthoptics post-baccalaureate certificate program is a vital part of the ophthalmic health care profession. This is a specialized profession, the focus of which is the evaluation and treatment of disorders of vision, eye movements, and eye alignment in children and adults. The study of orthoptics follows a logical sequence of studies vital to the understanding of the visual system. The didactic education is integrated with practical clinical experience. Orthoptists work with ophthalmologists, eye physicians and surgeons, as part of the medical team. They are employed in a variety of settings, including university and teaching hospitals, children's hospitals, and solo or multi-specialty group medical practices. An orthoptist sees a variety of patients of all ages, although due to the nature of their visual disorders, the majority of the patients are young children; some individuals with multiple health concerns are also evaluated as they commonly have ocular/binocular problems. \n\nStudents who successfully complete the Orthoptics post-baccalaureate certificate are eligible to sit for the written and practical examinations, administered by the American Orthoptic Council, required for national certification.",
    "programMinCredit": "14",
    "programMaxCredit": "28",
    "degreeMinCredit": null,
    "degreeMaxCredit": null
  },
  "23055I117-2024-09-03": {
    "uid": "23055I117-2024-09-03",
    "type": "Certificate",
    "career": "Undergraduate",
    "name": "Spanish Language Advanced-Level Proficiency Certificate",
    "diploma": "Spanish Language Advanced-Level Proficiency",
    "info": "This certificate is designed for students interested in achieving advanced-level proficiency in Spanish and having their skills formally recognized. People who have advanced-level proficiency in Spanish possess the speaking, reading, writing, and listening skills sufficient to satisfy the requirements of everyday situations at home and at work. They also generally understand and are understood by native speakers of Spanish. For an extended definition of advanced-level proficiency, please visit the American Council on the Teaching of Foreign Languages website: https://www.actfl.org/sites/default/files/guidelines/ACTFLProficiencyGuidelines2012.pdf \n\nThe Certificate of Advanced-Level Proficiency is open to all University of Minnesota undergraduate students, especially those who seek higher levels of Spanish proficiency in order to become more competitive for graduate or professional programs, careers with domestic Spanish-speaking populations, or international careers. ",
    "programMinCredit": 7,
    "programMaxCredit": 10,
    "degreeMinCredit": null,
    "degreeMaxCredit": null
  },
  "23085J315-2024-09-03": {
    "uid": "23085J315-2024-09-03",
    "type": "Certificate",
    "career": "Undergraduate",
    "name": "Medical Laboratory Sciences Certificate",
    "diploma": "Medical Laboratory Sciences",
    "info": "The medical laboratory sciences certificate program consists of 3 semesters of professional program courses and 1 semester of clinical practicum. Students from academic affiliate schools or those who already have a baccalaureate degree can apply for admission directly into the final professional year after completion of the prerequisites and the upper division science requirements. Admission is once a year for the upcoming fall semester. The program uses an active learning hybrid program delivery format. Courses are offered in person, through online modules, and through other technology-enhanced delivery methods. The MLS program is fully accredited by the National Accrediting Agency for Clinical Laboratory Sciences (NAACLS).\n\nThe program prepares students to be professional laboratory practitioners who are not only able to perform medical laboratory testing but analyze and critique the accuracy and validity of testing results for the improvement of patient care or research design. Graduates are eligible to take the American Society for Clinical Pathology Board of Certification examination and be certified as medical laboratory scientists (MLS). In addition to the medical laboratory setting, graduates of this program are qualified to work in a variety of other laboratory facilities such as research, environmental, biomedical, public health, or forensic laboratories. With the curriculum emphasis on developing quality understanding of laboratory methods and their diagnostic interpretation, our graduates are also excellent candidates for graduate research degree programs or graduate medical professional schools. Graduates of the MLS Program are also prepared to be leaders in healthcare delivery, medical laboratory professional societies, or as members of a research and development team. \n\nSince it began in 1922 as the first baccalaureate program for medical laboratory personnel, the MLS Program at the University of Minnesota has been a leader in the profession. The program is proud to provide students with the opportunity to learn from faculty who focus on clinical excellence, critical thinking, analysis, evaluation, scientific inquiry, leadership, and professional and community service. Current faculty perform laboratory-based research as well as scholarship in the field of teaching and learning. As a part of one of the nation's most extensive interdisciplinary academic health centers, the University of Minnesota's MLS program provides opportunities for interaction with students from other health professions as students prepare for a career in laboratory medicine.",
    "programMinCredit": 83,
    "programMaxCredit": null,
    "degreeMinCredit": null,
    "degreeMaxCredit": null
  },
  "23125I206-2024-09-03": {
    "uid": "23125I206-2024-09-03",
    "type": "Certificate",
    "career": "Graduate",
    "name": "Private College Leadership Postbaccalaureate Certificate",
    "diploma": "Private College Leadership",
    "info": "The Private College Leadership Certificate is not accepting new students at this time.\n\nCreated for professionals who are in faculty positions or beginning levels of college administration, this graduate-level certificate offers specific knowledge and skills related to organizational development, leadership, entrepreneurship, and decision-making necessary for leading independent colleges. The Emerging Leaders in Independent Colleges curriculum is designed for individuals who seek to move into leadership positions but do not have formal training related to leadership and management of independent colleges.",
    "programMinCredit": "12",
    "programMaxCredit": null,
    "degreeMinCredit": null,
    "degreeMaxCredit": null
  },
  "23135K207-2024-09-03": {
    "uid": "23135K207-2024-09-03",
    "type": "Certificate",
    "career": "Graduate",
    "name": "Data Science Postbaccalaureate Certificate",
    "diploma": "Data Science",
    "info": "The Data Science post-baccalaureate certificate program provides a strong foundation in the science of Big Data and its analysis by gathering in a single program the knowledge, expertise, and educational assets in data collection and management, data analytics, scalable data-driven pattern discovery, and the fundamental concepts behind these methods.\n\nStudents who graduate from this two-semester certificate program will learn the state-of-the-art methods for treating Big Data and be exposed to the cutting-edge methods and theories forming the basis for the next generation of Big Data technology.",
    "programMinCredit": "12",
    "programMaxCredit": "12",
    "degreeMinCredit": null,
    "degreeMaxCredit": null
  },
  "23165I308-2024-09-03": {
    "uid": "23165I308-2024-09-03",
    "type": "Certificate",
    "career": "Graduate",
    "name": "Clinical Ethics Postbaccalaureate Certificate",
    "diploma": "Clinical Ethics",
    "info": "Admissions to the clinical ethics post-baccalaureate certificate are currently on hold. Please contact bthxed@umn.edu for updates.\n\nThe Clinical Ethics Post-Baccalaureate Certificate will offer a graduate level educational opportunity for practicing professionals including physicians, nurses, social workers, chaplains, and others. Students will engage in classwork and practical experience geared toward mastery of the knowledge and skills needed for work in clinical ethics, including participation on ethics committees, clinical ethics consultation services, institutional and regional clinical ethics policy bodies, such as organ allocation committees or brain death committees, support for institutional staff development programs in their professional fields, or simply being better prepared to meet the ethical challenges that arise in their work. The curriculum will fulfill the health care ethics core competencies promulgated by the American Society for Bioethics and Humanities.",
    "programMinCredit": "13",
    "programMaxCredit": "13",
    "degreeMinCredit": null,
    "degreeMaxCredit": null
  },
  "23175J118-2024-09-03": {
    "uid": "23175J118-2024-09-03",
    "type": "Certificate",
    "career": "Undergraduate",
    "name": "Health Services Management Certificate",
    "diploma": "Health Services Management",
    "info": "The health services management certificate provides an option for current members of the health services workforce who need additional credentials and/or content knowledge for career advancement. Through a focused grouping of courses, students will gain conceptual understanding of business and management aspects of the health care industry along with analytical and problem-solving skills to apply that knowledge in a variety of settings. ",
    "programMinCredit": "21",
    "programMaxCredit": "22",
    "degreeMinCredit": null,
    "degreeMaxCredit": null
  },
  "23255I920-2024-09-03": {
    "uid": "23255I920-2024-09-03",
    "type": "Certificate",
    "career": "Graduate",
    "name": "Global Health Postbaccalaureate Certificate",
    "diploma": "Global Health",
    "info": "The Global Health Certificate is designed for students who have a strong interest in global health, who have a desire to understand cultures, and who may want to experience first-hand a global applied practice experience that could prepare them for work in a global setting. Many students may want to complete the Certificate to complement their graduate degree.\n\nIt is increasingly recognized that issues that affect health transcend national boundaries and that the development and implementation of solutions to such health problems require global cooperation. Global health represents an interdisciplinary approach that embraces both disease prevention in populations and the clinical care of individuals, with a strong emphasis on health equity and health as a public good.\n\nThe School of Public Health is accredited by the Council on Education for Public Health (CEPH).",
    "programMinCredit": "12",
    "programMaxCredit": "12",
    "degreeMinCredit": null,
    "degreeMaxCredit": null
  },
  "23365J217-2024-09-03": {
    "uid": "23365J217-2024-09-03",
    "type": "Certificate",
    "career": "Undergraduate",
    "name": "Chinese Language Advanced-Level Certificate",
    "diploma": "Advanced Chinese",
    "info": "The purpose of the Certificate is to recognize students who have reached an advanced level of proficiency in Modern Standard Chinese (ACTFL Advanced, ILR 2), along with training in literary Chinese and cultural literacy. Designated as a \"tier four\" language by the Foreign Service Institute, Chinese is acknowledged as one of the most difficult languages to master. Students who receive the certificate will have official recognition of this advanced level of proficiency in Chinese which can facilitate their post-college careers.",
    "programMinCredit": "20",
    "programMaxCredit": "50",
    "degreeMinCredit": null,
    "degreeMaxCredit": null
  },
  "23395J416-2024-09-03": {
    "uid": "23395J416-2024-09-03",
    "type": "Certificate",
    "career": "Graduate",
    "name": "Election Administration Postbaccalaureate Certificate",
    "diploma": "Election Administration",
    "info": "The Election Administration post-baccalaureate certificate prepares professional election officials across the country for advancement in the field as well as students interested in entering the field of election administration. Students will acquire and develop the skills and knowledge of election operations and procedures. All courses are offered in an online format and include topics such as election law, election security, data analysis, and voter participation. ",
    "programMinCredit": "12",
    "programMaxCredit": null,
    "degreeMinCredit": null,
    "degreeMaxCredit": null
  },
  "23395K316-2024-09-03": {
    "uid": "23395K316-2024-09-03",
    "type": "Certificate",
    "career": "Undergraduate",
    "name": "Election Administration Undergraduate Certificate",
    "diploma": "Election Administration",
    "info": "The undergraduate certificate in election administration prepares professional election officials across the country for advancement in the field as well as undergraduate students interested in entering the field of election administration. Students will acquire and develop the skills and knowledge of election operations and procedures. All courses are offered in an online format and include topics such as election law, election security, data analysis, and voter participation. ",
    "programMinCredit": "12",
    "programMaxCredit": null,
    "degreeMinCredit": null,
    "degreeMaxCredit": null
  },
  "23565J616-2023-09-05": {
    "uid": "23565J616-2023-09-05",
    "type": "Certificate",
    "career": "",
    "name": "Human Services Leadership Postbaccalaureate Certificate",
    "diploma": "Human Services Leadership",
    "info": "",
    "programMinCredit": "12",
    "programMaxCredit": null,
    "degreeMinCredit": null,
    "degreeMaxCredit": null
  },
  "23585J817-2024-09-03": {
    "uid": "23585J817-2024-09-03",
    "type": "Certificate",
    "career": "Undergraduate",
    "name": "French Advanced-Level Proficiency Certificate",
    "diploma": "French Advanced-Level Proficiency",
    "info": "This certificate is designed for students interested in achieving advanced-level proficiency in French and having their skills formally recognized. People who have advanced-level proficiency in French possess the speaking, reading, writing, and listening skills sufficient to satisfy the requirements of everyday situations at home and at work. They also generally understand and are understood by native speakers of French. For an extended definition of advanced-level proficiency, please visit the American Council on the Teaching of Foreign Languages website: https://www.actfl.org/sites/default/files/guidelines/ACTFLProficiencyGuidelines2012.pdf \n\nThe Certificate of Advanced-Level Proficiency is open to all University of Minnesota undergraduate students, especially those who seek higher levels of French proficiency in order to become more competitive for graduate or professional programs, careers with domestic French-speaking populations, or international careers.",
    "programMinCredit": "6",
    "programMaxCredit": "8",
    "degreeMinCredit": null,
    "degreeMaxCredit": null
  },
  "23595J917-2024-09-03": {
    "uid": "23595J917-2024-09-03",
    "type": "Certificate",
    "career": "Undergraduate",
    "name": "German Advanced-Level Proficiency Certificate",
    "diploma": "German Advanced-Level Proficiency",
    "info": "This certificate is designed for students interested in achieving advanced-level proficiency in German and having their skills formally recognized. People who have advanced-level proficiency in German possess the speaking, reading, writing, and listening skills sufficient to satisfy the requirements of everyday situations at home and at work. They also generally understand and are understood by native speakers of German. For an extended definition of advanced-level proficiency, please visit the American Council on the Teaching of Foreign Languages website: www.actfl.org/sites/default/files/pdfs/ACTFLProficiencyGuidelines2012_FINAL.pdf \n\nThe Certificate of Advanced-Level Proficiency is open to all University of Minnesota undergraduate students, especially those who seek higher levels of German proficiency in order to become more competitive for graduate or professional programs, careers with domestic German-speaking populations, or international careers.",
    "programMinCredit": "6",
    "programMaxCredit": "8",
    "degreeMinCredit": null,
    "degreeMaxCredit": null
  },
  "23725K503-2023-09-01": {
    "uid": "23725K503-2023-09-01",
    "type": "Certificate",
    "career": "",
    "name": "Veterinary Medical Education",
    "diploma": "Veterinary Medical Education",
    "info": "TBD",
    "programMinCredit": 30,
    "programMaxCredit": null,
    "degreeMinCredit": null,
    "degreeMaxCredit": null
  },
  "23795K618-2024-09-03": {
    "uid": "23795K618-2024-09-03",
    "type": "Certificate",
    "career": "Graduate",
    "name": "Human Sexuality Postbaccalaureate Certificate",
    "diploma": "Human Sexuality",
    "info": "Human sexuality and associated gender roles and sexual behavior are an integral part of health care, clinical and social sciences, biological sciences, and a determinant of population dynamics and population science. The HIV pandemic, and the prevalence of sexually transmitted infections (STIs) worldwide, make training in human sexuality an essential component of international development, reproductive and population health, and social policy. Sexual health issues are often part of a clinically-oriented medical curriculum, and this online certificate broadens human sexuality education to a wider audience across the US and internationally. The Human Sexuality certificate will fulfill part of the requirements towards AASECT certification for sex educators in the components of core knowledge and sexuality education training.",
    "programMinCredit": "12",
    "programMaxCredit": "12",
    "degreeMinCredit": null,
    "degreeMaxCredit": null
  },
  "23825K722-2024-09-03": {
    "uid": "23825K722-2024-09-03",
    "type": "Certificate",
    "career": "Graduate",
    "name": "Advanced Wearable Products Post-Baccalaureate Certificate",
    "diploma": "Advanced Wearable Products",
    "info": "The Advanced Wearable Products certificate is a supplemental curriculum intended to provide and deepen interdisciplinary skills and knowledge related to the design, development, and assessment of wearable functional products including wearable technology, functional clothing, and personal protective equipment. ",
    "programMinCredit": "12",
    "programMaxCredit": null,
    "degreeMinCredit": null,
    "degreeMaxCredit": null
  },
  "23875K817-2024-09-03": {
    "uid": "23875K817-2024-09-03",
    "type": "Certificate",
    "career": "Undergraduate",
    "name": "Career Readiness Certificate",
    "diploma": "Career Readiness",
    "info": "The career readiness certificate is earned by students who intentionally and intensively engage in the career development process during their undergraduate program. The certificate program challenges students to think about the totality of their liberal arts degree and the acquisition of the core career competencies. The curriculum is designed to support students from the exploration stage of the career management process and prepares them to compete for significant experiences, and ultimately reinforces the necessary reflection required to articulate their proficiency in the core career competencies. \n\nThe certificate will signal to potential employers and graduate programs that students have demonstrated the ability to describe their unique academic path in the College of Liberal Arts, what they've learned in the process, and how that relates to their readiness. It encourages the integration of academics and co-curricular experiences through the common language of core career competencies and connects the academic experience to their professional life. \n\nThe certificate is open to all CLA undergraduate students.",
    "programMinCredit": "5",
    "programMaxCredit": "15",
    "degreeMinCredit": null,
    "degreeMaxCredit": null
  },
  "24255M502-2024-09-03": {
    "uid": "24255M502-2024-09-03",
    "type": "Certificate",
    "career": "Graduate",
    "name": "Strategic Management Postbaccalaureate Certificate",
    "diploma": "Strategic Management",
    "info": "The Strategic Management certificate draws on insights of strategic decisions that drive success or failure within an organization. Candidates will study cases, complete group projects, and dive deeply into curriculum that exposes them to the difficult landscape of organizational decision making.",
    "programMinCredit": "12",
    "programMaxCredit": null,
    "degreeMinCredit": null,
    "degreeMaxCredit": null
  },
  "24265L620-2024-09-03": {
    "uid": "24265L620-2024-09-03",
    "type": "Certificate",
    "career": "Graduate",
    "name": "American Indian Public Health and Wellness Post-Baccalaureate Certificate",
    "diploma": "American Indian Public Health and Wellness",
    "info": "The American Indian Public Health and Wellness certificate prepares students to understand how to work respectfully and effectively with Tribes and American Indian communities, to understand the basis of health services, and study the implication of specific local and federal laws to improve the health issues currently experienced by American Indians. \n\nStudents from all races, cultures, and experience are welcome to pursue the certificate. While the focus is on American Indians, there are advantages to learning accurate history, other health models, innovative health services, and the importance of using a holistic approach of health and wellness for all populations. Increasing the knowledge of health professionals (e.g., state, federal, educational institutions and private public health employees) and increasing a culturally prepared workforce is the aim of this certificate.  \n\nThe School of Public Health is accredited by the Council on Education for Public Health (CEPH).",
    "programMinCredit": "12",
    "programMaxCredit": 12,
    "degreeMinCredit": null,
    "degreeMaxCredit": null
  },
  "24315L717-2024-09-03": {
    "uid": "24315L717-2024-09-03",
    "type": "Certificate",
    "career": "Undergraduate",
    "name": "Editing and Publishing Certificate",
    "diploma": "Editing and Publishing",
    "info": "The Editing and Publishing Certificate provides students with the skills, knowledge, and experience necessary to enter the field of publishing. The certificate focuses particularly, but not exclusively, on literary publishing. Students take two required upper-division courses and complete an experiential learning requirement. The courses are designed to introduce students to the process, protocol, and philosophy of editing (including the conventions of grammar, story, and style), as well as the fundamentals of many other aspects of the publishing industry (including acquisitions and project management, design and printing, publicity and marketing, sales and distribution, fundraising and grant writing, copyright and permissions, and bookselling and book reviewing). The experiential learning requirement offers students an intensive, immersive experience in one or more aspects of editing and publishing, intended to prepare them for employment in the publishing industry as well as a wide range of related fields (including media outlets, NGOs, think tanks, advocacy groups, PR firms, foundations, government agencies, and institutions involved in cultural, artistic, educational, and community programming).\n\nThe certificate is open to all University of Minnesota undergraduate students.",
    "programMinCredit": "8",
    "programMaxCredit": "15",
    "degreeMinCredit": null,
    "degreeMaxCredit": null
  },
  "24415L802-2024-09-03": {
    "uid": "24415L802-2024-09-03",
    "type": "Certificate",
    "career": "Graduate",
    "name": "Closely-Held Business Taxation Postbaccalaureate Certificate",
    "diploma": "Closely-Held Business Taxation",
    "info": "The Closely-Held Business Taxation certificate is designed for tax professionals seeking a credential that identifies them as a tax expert in the field while preparing graduates for greater responsibilities in business management and consulting. A rigorous curriculum, taught online by top faculty in the tax community, focuses on the analytical, problem-solving, writing, and communication skills that foster career advancement. The certificate can be completed in 12 to 24 months, with breaks from early March through April 15, to accommodate schedules during peak tax season.",
    "programMinCredit": "12",
    "programMaxCredit": null,
    "degreeMinCredit": null,
    "degreeMaxCredit": null
  },
  "24425L902-2024-09-03": {
    "uid": "24425L902-2024-09-03",
    "type": "Certificate",
    "career": "Graduate",
    "name": "High Net-Worth Individual Taxation Postbaccalaureate Certificate",
    "diploma": "High Net-Worth Individual Taxation",
    "info": "The High Net-Worth Individual Taxation certificate is designed for tax professionals seeking a credential that identifies them as a tax expert in the field while preparing graduates for greater responsibilities in financial consulting. A rigorous curriculum, taught online by top faculty in the tax community, focuses on the analytical, problem solving, writing, and communication skills that foster career advancement. The certificate can be completed in 12 to 24 months, with breaks from early March through April 15 to accommodate schedules during peak tax season.",
    "programMinCredit": "12",
    "programMaxCredit": null,
    "degreeMinCredit": null,
    "degreeMaxCredit": null
  },
  "24435M102-2024-09-03": {
    "uid": "24435M102-2024-09-03",
    "type": "Certificate",
    "career": "Graduate",
    "name": "International Taxation Postbaccalaureate Certificate",
    "diploma": "International Taxation",
    "info": "The International Taxation certificate is designed for tax professionals seeking a credential that identifies them as an expert in the field while preparing graduates for greater responsibilities in business management and consulting. A rigorous curriculum, taught online by top faculty in the tax community, focuses on the analytical, problem-solving, writing, and communication skills that foster career advancement. The certificate can be completed in 12 to 24 months, with breaks from early March through April 15 to accommodate schedules during peak tax season.",
    "programMinCredit": "12",
    "programMaxCredit": null,
    "degreeMinCredit": null,
    "degreeMaxCredit": null
  },
  "24445M202-2024-09-03": {
    "uid": "24445M202-2024-09-03",
    "type": "Certificate",
    "career": "Graduate",
    "name": "Tax Executive Postbaccalaureate Certificate",
    "diploma": "Tax Executive",
    "info": "The Tax Executive certificate is designed primarily for tax professionals working in tax departments of large corporations. It prepares graduates for greater responsibilities within their tax department. A rigorous curriculum, taught online by top faculty in the tax community, focuses on the analytical, problem solving, writing, and communication skills that foster career advancement. The certificate can be completed in 12 to 24 months, with breaks from early March through April 15 to accommodate schedules during peak tax season.",
    "programMinCredit": "12",
    "programMaxCredit": null,
    "degreeMinCredit": null,
    "degreeMaxCredit": null
  },
  "24455M302-2024-09-03": {
    "uid": "24455M302-2024-09-03",
    "type": "Certificate",
    "career": "Graduate",
    "name": "Taxation Postbaccalaureate Certificate",
    "diploma": "Taxation",
    "info": "The Certificate in Taxation is designed for tax professionals seeking a credential that identifies them as an expert in the field while preparing graduates for greater responsibilities in business management and consulting. A rigorous curriculum, taught online by top faculty in the tax community, focuses on the analytical, problem solving, writing, and communication skills that foster career advancement. The certificate can be completed in 12 to 24 months, with breaks from early March through April 15 to accommodate schedules during peak tax season.",
    "programMinCredit": "12",
    "programMaxCredit": null,
    "degreeMinCredit": null,
    "degreeMaxCredit": null
  },
  "24465M602-2024-09-03": {
    "uid": "24465M602-2024-09-03",
    "type": "Certificate",
    "career": "Graduate",
    "name": "Asset Management Postbaccalaureate Certificate",
    "diploma": "Asset Management",
    "info": "",
    "programMinCredit": "12",
    "programMaxCredit": null,
    "degreeMinCredit": null,
    "degreeMaxCredit": null
  },
  "24475M702-2024-09-03": {
    "uid": "24475M702-2024-09-03",
    "type": "Certificate",
    "career": "Graduate",
    "name": "Corporate Financial Management Postbaccalaureate Certificate",
    "diploma": "Corporate Financial Management",
    "info": "The Corporate Finance certificate is a curated introductory credential that lays out the foundations of the discipline for those seeking to enter or advance. It is designed to convey a comprehensive understanding of financial management principles, the essentials of financial planning and analysis, major financial decisions, and business valuation.",
    "programMinCredit": "12",
    "programMaxCredit": null,
    "degreeMinCredit": null,
    "degreeMaxCredit": null
  },
  "24485M802-2024-09-03": {
    "uid": "24485M802-2024-09-03",
    "type": "Certificate",
    "career": "Graduate",
    "name": "Leadership for Managers Postbaccalaureate Certificate",
    "diploma": "Leadership for Managers",
    "info": "The Leadership for Managers Certificate offers candidates a challenging academic curriculum that teaches critical management, team leadership, and problem-solving skills. Candidates will apply real world knowledge through hands-on opportunities and develop a culture of teamwork and collaboration to meet organizational goals.  ",
    "programMinCredit": "12",
    "programMaxCredit": null,
    "degreeMinCredit": null,
    "degreeMaxCredit": null
  },
  "24495M902-2024-09-03": {
    "uid": "24495M902-2024-09-03",
    "type": "Certificate",
    "career": "Graduate",
    "name": "Strategic Marketing Postbaccalaureate Certificate",
    "diploma": "Strategic Marketing",
    "info": "The Strategic Marketing certificate explores the most current practices in digital, social media, and traditional marketing. The curriculum covers strategic decisions and creates a better understanding of the marketing needs of the firm, while leveraging the power of marketing techniques used in business today. ",
    "programMinCredit": "12",
    "programMaxCredit": null,
    "degreeMinCredit": null,
    "degreeMaxCredit": null
  },
  "24525N118-2024-09-03": {
    "uid": "24525N118-2024-09-03",
    "type": "Certificate",
    "career": "Graduate",
    "name": "Leadership for Science Professionals Postbaccalaureate Certificate",
    "diploma": "Leadership for Science",
    "info": "The Leadership for Science Professionals (LSP) certificate is designed for individuals—whether career starters or career advancers—seeking the strong foundation in leadership skills necessary for advancement in a wide range of professional science and science-adjacent careers in government, non-profit agencies, international organizations, and corporations.  The LSP certificate can be completed as a standalone credential or in conjunction with other University graduate degrees.",
    "programMinCredit": "12",
    "programMaxCredit": "12",
    "degreeMinCredit": null,
    "degreeMaxCredit": null
  },
  "24535N202-2024-09-03": {
    "uid": "24535N202-2024-09-03",
    "type": "Certificate",
    "career": "Graduate",
    "name": "Medical Industry Postbaccalaureate Certificate",
    "diploma": "Medical Industry",
    "info": "The Medical Industry certificate provides a curriculum that uses an interdisciplinary and intercollegiate approach to provide market analysis of promising medical technologies and services. Candidates will learn from industry experts on the healthcare marketplace, institutions, regulations, reimbursement, payment, and healthcare analytics.",
    "programMinCredit": "12",
    "programMaxCredit": null,
    "degreeMinCredit": null,
    "degreeMaxCredit": null
  },
  "24545N302-2024-09-03": {
    "uid": "24545N302-2024-09-03",
    "type": "Certificate",
    "career": "Graduate",
    "name": "Supply Chain Management for the Medical and Health Sector Postbaccalaureate Certificate",
    "diploma": "Supply Chain Medical & Health",
    "info": "The Supply Chain Management for the Medical & Health Sector certificate offers a foundation for supply chain operations in the medical industry and beyond. Curriculum focuses on an understanding of inputs to outputs, analysis of industrial resources and management of complex logistics, and supply chain found within the medical and healthcare sectors.",
    "programMinCredit": "13",
    "programMaxCredit": null,
    "degreeMinCredit": null,
    "degreeMaxCredit": null
  },
  "24585O218-2024-09-03": {
    "uid": "24585O218-2024-09-03",
    "type": "Certificate",
    "career": "Undergraduate",
    "name": "Long Term Care Management Certificate",
    "diploma": "Long Term Care Management",
    "info": "This certificate utilizes existing state-accredited long term care courses from the Health Services Management program to prepare students to lead in the burgeoning field of long-term services and supports. Graduates may lead a nursing home, assisted living facility, independent senior housing, home care, hospice, or other nonprofit that serves older adults and their families. Through this certificate, students will be eligible to obtain Licensed Nursing Home Administrator and Assisted Living Director credentials in Minnesota. The certificate is intended for non-degree-seeking undergraduate level professional students.",
    "programMinCredit": "12",
    "programMaxCredit": "12",
    "degreeMinCredit": null,
    "degreeMaxCredit": null
  },
  "24615N420-2024-09-03": {
    "uid": "24615N420-2024-09-03",
    "type": "Certificate",
    "career": "Graduate",
    "name": "Healthcare Management Postbaccalaureate Certificate",
    "diploma": "Healthcare Management",
    "info": "The Healthcare Management Certificate is designed for employed healthcare business and clinical professionals seeking to advance their management and leadership competencies. It provides students with practical knowledge and skills that can be applied immediately within their organizations. The certificate curriculum includes a focus on management in healthcare organizations and systems and is instructed by a combination of active practitioners and research-active faculty. The coursework is designed to fit the lives of busy professionals: most of the coursework is online and asynchronous. Students in the certificate who decide to pursue the Master of Healthcare Administration degree can apply to the executive track and, if admitted, complete the degree by finishing the remaining required coursework. ",
    "programMinCredit": "12",
    "programMaxCredit": null,
    "degreeMinCredit": null,
    "degreeMaxCredit": null
  },
  "24635N518-2024-09-03": {
    "uid": "24635N518-2024-09-03",
    "type": "Certificate",
    "career": "Undergraduate",
    "name": "Environmental Health and Safety Certificate",
    "diploma": "Environmental Health & Safety",
    "info": "THIS PROGRAM IS NO LONGER ADMITTING STUDENTS. The Environmental Health and Safety certificate will equip professionals with the knowledge and skills necessary to successfully manage and administer safety programs. The five required courses are taught online. The curriculum focuses on technical information, critical thinking skills, legal and ethical concepts, effective communication and interpersonal skills, management principles, and the ability to work as a member or leader of a team. Courses explore the complex and unique challenges facing safety professionals, such as constrained resources, increased demand for services, risk assessment, the media, and public perception. Environmental health and safety is a complex subject because many factors influence the effect of the environment on human health. The curriculum recognizes the interrelation of environmental health and diverse geography, according to states or countries as well as urban versus rural environments. Diverse population demographics such as age, gender, ethnicity, culture, socioeconomics, and underlying susceptibilities of people also influence the impact the environment has on human health. All these aspects need to be considered when assessing risks and managing environmental health in the workplace and are broadly reflected in the curriculum.  ",
    "programMinCredit": "18",
    "programMaxCredit": "18",
    "degreeMinCredit": null,
    "degreeMaxCredit": null
  },
  "24675N606-2024-09-03": {
    "uid": "24675N606-2024-09-03",
    "type": "Certificate",
    "career": "Undergraduate",
    "name": "Sales Certificate",
    "diploma": "Sales",
    "info": "The Sales Certificate is an undergraduate-level certificate that includes 16-17 credits. The prerequisites include 45 credits required for admission and degree-seeking student status.\n\nThis certificate will provide you with unique experiences in furthering your knowledge in sales education while developing practical skills for sales training. Additionally, the Sales Certificate curriculum embodies an important focus on education and human development as you will learn and apply critical models for sales education and training. Models for sales education include a focus on peer to peer instruction for the sales cycle. In this process, you will learn applications for teaching sales topics to a sales organization and how to identify growth opportunities for further sales training.  ",
    "programMinCredit": "16",
    "programMaxCredit": "17",
    "degreeMinCredit": null,
    "degreeMaxCredit": null
  },
  "24685N803-2024-09-03": {
    "uid": "24685N803-2024-09-03",
    "type": "Certificate",
    "career": "Graduate",
    "name": "Poultry Health Postbaccalaureate Certificate",
    "diploma": "Poultry Health",
    "info": "The Poultry Health post-baccalaureate certificate is a 12-credit, 12-month online program designed for early- to mid-career professionals interested in advanced understanding of poultry health and disease. The certificate focuses on basic understanding of the avian host as it relates to poultry production systems, the technologies and tools to assess health, and diagnosing and addressing disease at the gross and molecular levels. The enhanced knowledge and hands-on experience with applied and/or molecular tools will position graduates to deal with commonly encountered and investigated issues that arise in poultry production and allied industries. In addition to the online curriculum, elective experiential credits are offered by the Mid-Central Research and Outreach Center in Willmar, MN.",
    "programMinCredit": "12",
    "programMaxCredit": null,
    "degreeMinCredit": null,
    "degreeMaxCredit": null
  },
  "24705N902-2024-09-03": {
    "uid": "24705N902-2024-09-03",
    "type": "Certificate",
    "career": "Graduate",
    "name": "Entrepreneurship & Innovation Postbaccalaureate Certificate",
    "diploma": "Entrepreneurship & Innovation",
    "info": "How do you take a new idea or technology and turn it into a commercially successful offering? The post-baccalaureate certificate in Entrepreneurship & Innovation brings together a set of courses designed to help take you through that journey: from idea generation and opportunity identification, through business planning, funding, product development, and testing, all the way to managing a growing business. Whether your goal is to learn how to start a new firm or grow a creative idea within an existing one, this certificate offers a fundamental understanding of the principles through which new innovations achieve and sustain success.",
    "programMinCredit": "12",
    "programMaxCredit": null,
    "degreeMinCredit": null,
    "degreeMaxCredit": null
  },
  "24765O106-2024-09-03": {
    "uid": "24765O106-2024-09-03",
    "type": "Certificate",
    "career": "Graduate",
    "name": "Learning Sciences Postbaccalaureate Certificate",
    "diploma": "Learning Sciences",
    "info": "The Learning Sciences post-baccalaureate certificate provides a strong foundation in learning theory and methodology across diverse educational environments to promote effective design, implementation, and assessment of human learning.",
    "programMinCredit": "12",
    "programMaxCredit": 12,
    "degreeMinCredit": null,
    "degreeMaxCredit": null
  },
  "24855O518-2024-09-03": {
    "uid": "24855O518-2024-09-03",
    "type": "Certificate",
    "career": "Graduate",
    "name": "Sex Therapy Postbaccalaureate Certificate",
    "diploma": "Sex Therapy",
    "info": "The 12-credit graduate-level online certificate in Sex Therapy is offered in partnership with the Institute for Sexual and Gender Health, University of Minnesota Medical School. ",
    "programMinCredit": "12",
    "programMaxCredit": "12",
    "degreeMinCredit": null,
    "degreeMaxCredit": null
  },
  "24865O618-2024-09-03": {
    "uid": "24865O618-2024-09-03",
    "type": "Certificate",
    "career": "Graduate",
    "name": "Regulatory Affairs for Food Professionals Postbaccalaureate Certificate",
    "diploma": "Regulatory Affairs for Food Professionals",
    "info": "The Regulatory Affairs for Food Professionals postbaccalaureate certificate is a graduate-level credential that prepares individuals for professional careers in the government sector, non-profit agencies, international organizations, and corporations with more engagement in leadership practices within regulatory affairs. Graduates will be well prepared to contribute and collaborate on problem solving and real solutions.",
    "programMinCredit": "12",
    "programMaxCredit": "12",
    "degreeMinCredit": null,
    "degreeMaxCredit": null
  },
  "24905O906-2024-09-03": {
    "uid": "24905O906-2024-09-03",
    "type": "Certificate",
    "career": "Graduate",
    "name": "Learning Analytics Postbaccalaureate Certificate",
    "diploma": "Learning Analytics",
    "info": "The Learning Analytics postbaccalaureate certificate aims to develop skills in the use of data to optimize learning and the environments in which it occurs. Learning analytics uses the power of information technology and data science to improve learning and teaching in various contexts. \n\nWith the rise of big data, knowing how to effectively and ethically utilize educational data to inform research and practice is crucial. The Learning Analytics Certificate advances these missions by leveraging information technology, data analytics, and learning sciences to better inform educational research and practice.\n\nThe certificate is structured to develop understanding in three core areas - foundations, theory, and analytics - while offering flexibility in coursework to accommodate students from different academic backgrounds and programs.",
    "programMinCredit": "12",
    "programMaxCredit": null,
    "degreeMinCredit": null,
    "degreeMaxCredit": null
  },
  "24965P318-2024-09-03": {
    "uid": "24965P318-2024-09-03",
    "type": "Certificate",
    "career": "Graduate",
    "name": "Transgender & Gender Diverse Health Postbaccalaureate Certificate",
    "diploma": "Trans & Gender Diverse Health",
    "info": "The 12-credit graduate-level online certificate in Transgender & Gender Diverse Health is offered by the College of Continuing and Professional Studies (CCAPS) in collaboration with the Institute for Sexual and Gender Health (ISGH) and the National Center for Gender Spectrum Health (NCGSH). Students may complete this certificate as a standalone credential, as elective coursework for their graduate degree housed outside of CCAPS, or as a second 12 credit certificate in the 30 credit Master of Professional Studies in Sexual Health (MPSSH) degree. Students who elect to complete the Sexual Health degree can earn up to 3 graduate-level credentials, enhancing their employability and providing them with a strong foundation in the content knowledge areas required for future certification with the World Professional Association for Transgender Health (WPATH).",
    "programMinCredit": "12",
    "programMaxCredit": "12",
    "degreeMinCredit": null,
    "degreeMaxCredit": null
  },
  "25005P414-2024-09-03": {
    "uid": "25005P414-2024-09-03",
    "type": "Certificate",
    "career": "Graduate",
    "name": "Pediatric Nurse Practitioner - Acute Care Post-Graduate Certificate",
    "diploma": "Pediatric Nurse Practitioner Acute Care",
    "info": "The postgraduate certificate program in nursing offers students with a doctor of nursing practice (DNP)  degree in a clinical nursing specialty area the opportunity to complete an additional area of study. Completion of required coursework and practice hours provides eligibility to take certification examination.",
    "programMinCredit": "16",
    "programMaxCredit": "28",
    "degreeMinCredit": null,
    "degreeMaxCredit": null
  },
  "25015P514-2024-09-03": {
    "uid": "25015P514-2024-09-03",
    "type": "Certificate",
    "career": "Graduate",
    "name": "Population Health Informatics & Technology Post Baccalaureate Certificate",
    "diploma": "Population Health Informatics & Technology",
    "info": "The Population Health Informatics and Technology (PHIT) Post-Baccalaureate Certificate prepares trainees to harness the power of data for improving public and population health. Students will learn about various information systems in public health, electronic data exchanges and tools for consumer engagement along with the utility of data for health equity and better population health. The certificate courses are offered in a fully online format and includes a practicum that provides experience in public health and non-profit care settings. The PHIT certificate is funded in part by a grant from the Office of the National Coordinator for Health Information Technology for Public Health IT Workforce Development. ",
    "programMinCredit": "12",
    "programMaxCredit": "12",
    "degreeMinCredit": null,
    "degreeMaxCredit": null
  },
  "25035P722-2024-09-03": {
    "uid": "25035P722-2024-09-03",
    "type": "Certificate",
    "career": "Undergraduate",
    "name": "Design Justice Certificate",
    "diploma": "Design Justice",
    "info": "This program focuses on addressing structural inequality in design through social, cultural, and environmental lenses. Courses from multiple design disciplines within the College of Design offer an in-depth understanding of how design creates benefits and burdens for people with different identities, as well as how design applies and enhances community-based, indigenous practices and knowledge.",
    "programMinCredit": "15",
    "programMaxCredit": null,
    "degreeMinCredit": null,
    "degreeMaxCredit": null
  },
  "25045P804-2023-09-05": {
    "uid": "25045P804-2023-09-05",
    "type": "Certificate",
    "career": "",
    "name": "Oral Health Educator Certificate",
    "diploma": "Oral Health Educator",
    "info": "The Oral Health Educator Certificate program is a 4 course, 12-credit program focused on educational methodology and effective clinical and didactic teaching practices for dental, dental therapy, and dental hygiene educators. Students in the Academic Dental Career Fellowship Program are also eligible.",
    "programMinCredit": "12",
    "programMaxCredit": "12",
    "degreeMinCredit": null,
    "degreeMaxCredit": null
  },
  "25065Q107-2024-09-03": {
    "uid": "25065Q107-2024-09-03",
    "type": "Certificate",
    "career": "Graduate",
    "name": "Electrification Engineering Postbaccalaureate Certificate",
    "diploma": "Electrification Engineering",
    "info": "The Postbaccalaureate Certificate in Electrification Engineering is designed to provide technologists, engineers, and technically-focused managers with an applied graduate credential focusing on the core systems underpinning the electrified world. This 12-credit program is suitable for industry professionals and new college graduates looking for a hands-on learning approach with immediately applicable skills. The certificate program covers the breadth of technologies used to convert traditional mechanical systems into hybrid or electric platforms. The core curriculum begins with a technical survey course and progresses to more technically complex course content. Elective courses focus on electrification policy, electrical engineering, or mechanical engineering. The certificate program provides students with the skills to migrate to the world of electrification systems and contribute to an electrified future. ",
    "programMinCredit": "12",
    "programMaxCredit": "12",
    "degreeMinCredit": null,
    "degreeMaxCredit": null
  },
  "25105Q214-2024-09-03": {
    "uid": "25105Q214-2024-09-03",
    "type": "Certificate",
    "career": "Graduate",
    "name": "Adult Gerontological Acute Care Nurse Practitioner Post-Graduate Certificate",
    "diploma": "Adult/Gerontological Acute Care Nurse Practitioner",
    "info": "The post-graduate certificate program in nursing offers students with a doctor of nursing practice (DNP) degree in a clinical nursing specialty area the opportunity to complete an additional area of study. Completion of required coursework and practice hours provides eligibility to take certification examination.",
    "programMinCredit": "13",
    "programMaxCredit": "29",
    "degreeMinCredit": null,
    "degreeMaxCredit": null
  },
  "25135Q307-2024-09-03": {
    "uid": "25135Q307-2024-09-03",
    "type": "Certificate",
    "career": "Graduate",
    "name": "Technology Leadership Postbaccalaureate Certificate",
    "diploma": "Technology Leadership",
    "info": "The Postbaccalaureate Certificate in Technology Leadership is designed to provide technology industry professionals with critical competencies in personal leadership, organizational development, business and future technologies, and growth of leadership roles in technology organizations. The required coursework covers these core competencies that have been identified as driving success in a technology leader, and elective credits allow students to tailor the experience to their specific technical profession. Coursework from the Certificate can be applied to master's degrees in the Technological Leadership Institute upon admission and with program approval.",
    "programMinCredit": "12",
    "programMaxCredit": "12",
    "degreeMinCredit": null,
    "degreeMaxCredit": null
  }
}